package com.ohgiraffers.section01.extend;

public class Application {

    public static void main(String[] args) {

        /* 수업목표. 상속에 대해 이해할 수 있다. */
        /* 필기.
        *   상속(inheritance)은 현실 세계의 상속과 비슷한 개념이다.
        *   부모가 가지고 있는 재산(자바에서는 클래스가 가지는 멤버)을 자식이 물려받는 의미이다.
        *   클래스 또한 부모 클래스와 자식 클래스로 역할을 나누어서 부모가 가지는 멤버를 자식이
        *   물려받아 자기의 멤버인 것 처럼 사용할 수 있도록 만든 기술이다.
        *
        *  필기.
        *   하지만 단순 물려받는 개념보다 조금 더 나아간다면
        *   자바에서의 상속은 부모클래스의 확장(extend) 의 개념을 가진다.
        *   물려 받아서 자신의 것 처럼 사용하는 것 뿐 아니라 추가적인 멤버도 작성이 가능하다.
        *   특히 메소드 재정의(overriding) 이라는 기술을 이용해서 부모가 가진 메소드를 재정의 하는
        *   것도 가능하다.
        *
        *  필기.
        *   메소드 재정의(overriding) 이란, 부모가 가지는 메소드 선언부를 그대로 사용하면서
        *   자식 클래스가 정의한 메소드대로 동작하도록 구현 몸체 {} 부분을 새롭게 다시 작성하는 것이다.
        *   메소드 재정의를 하면 메소드를 호출할 시 재정의 한 메소드가 우선적으로 동작하게 된다.
        *  */

    }

}
